# -*- coding: utf-8 -*-
#Роздрукувати вміст змінної msg шляхами, перший набравши назву змінної в інтентерпретаторі, другий - використавши команду print.
msg = 'Khrystyna Leshchyshyn'
msg

print msg

#Використовуючи зрізи та операцію поєднання змінити стрічку msg  до вигляду імя, прізвище, по батькові.
msg [0:20]
msg [0:21]
msg = 'Khrystyna Leshchyshyn'
msg1 = 'Olegivna'
print msg, msg1
msg[::1]

#Поясніть результат виконання msg[::-1].  Дана програма розглядає всі елементи стрічки msg, але з кінця - крок -1.

#Представити прізвище, імя та по батькові як список стрічок. Здійснити різноманітні операції індексування, сортування та зрізів. Реалізуйте операцію доступу до окремих елементів списку та операцій з ними.
phrase = ['Leshchyhyn','Khrystyna','Olegivna']
phrase
phrase[1]
phrase[0]
phrase[0:3]
phrase.sort()
phrase
phrase.reverse()
phrase
phrase.index ('Khrystyna')
phrase.append ('Olegivna')

#Виконайте наступну послідовність дій та спробуйте пояснити отримані результати
#Рядок а - це арифметична прогресія, яка спочатку наростає до семи а потім спадає. Рядок б - це команда, яка виводить на екран слова у вигляді ромбу.


#Створити змінну words, яка містить список слів. Дослідіть операції words.sort() і sorted(words)

words = ['autumn','spring','winter','summer']
words.sort()
words
words = ['Autumn','Spring','winter','summer']
sorted(words)
# Перша функція сортує всі лова за алфавітом, а друга функція сортує спосатку слова, які починаються з великої букви також за алфавітом.


# Перетворіть стрічку msg на список стрічок, кожна з яких відповідає одному слову використовуючи split() оператор без символа розділення та наступними символами розділення: подвійні лапки, табуляція, послідовність пробілів, послідовність табуляцій та пробілів.
msg = 'Leshchyhyn Khrystyna Olegivna'
msg1 = msg.split()
msg1
words = msg.split()
for word in words:
	print word

words = msg.split(' ')
msg1


#Використайте функцію index() наступним чином 'inexpressible'.index('e'). Що станеться якщо виконати 'inexpressible'.index('re')
'inexpressible'.index('e') # отримали індекс або номер місцезнаходження першого елемента 'e'
'inexpressible'.index('re') # отримали індекс буквосполучення 're'
